app/controllers/campaigns_controller.rb

  def create
    @campaign = Campaign.new(campaign_params)

    respond_to do |format|
      if @campaign.save
---
INSERT INTO "campaigns" ("title", "description", "user_id", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Nova Campanha"], ["description", "Descreva sua campanha..."], ["user_id", 1], ["status", 0], ["created_at", "2018-02-07 23:49:33.270982"], ["updated_at", "2018-02-07 23:49:33.270982"]]

  def set_campaign
    @campaign = Campaign.find(params[:id])
---
SELECT  "campaigns".* FROM "campaigns" WHERE "campaigns"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]